[
  {
    "company": "Airble Aviation Inc.",
    "position": "Full Stack Developer",
    "description": "Contributed features and maintained an Android and iOS mobile application, two web applications (one legacy and one modern), a legacy REST service, and a GraphQL web API.",
    "experience": [
      "Coordinated and deployed fixes for over 5 critical issues without errors for a user base of over 15,000 users",
      "Completed a large project that required new UI elements, over 5 new API endpoints, multiple transactional emails, and 3 database tables from the brainstorming stage",
      " Achieved backend performance improvements of up to 80% by optimizing SQL statements and server logic",
      " Improved the legibility of critical server code, resulting in 200 fewer lines of code, by packaging duplicate code into functions",
      " Enabled marketing to create ads for specific flights by utilizing an npm package to store the web page's state in URI parameters",
      " Reduced development time by 70% when creating an identical component that existed on the app but not yet on the website by structuring the component to be easily styled with SCSS instead of inline CSS",
      " Improved page loading performance by as much as 80% by using the Next.js framework’s static server props to load and cache data at build time",
      " Reduced to number of broken builds per-month to 1-2 from 5-10 by introducing git hooks to verify the build before a developer attempts to merge their changes"
    ]
  },
  {
    "company": "TENZR Health",
    "position": "Software/DevOps Developer",
    "description": "Created and maintained a CI/CD pipeline using Azure DevOps for a Xamarin mobile app built for both iOS and UWP devices and for an Express.js REST service.",
    "experience": [
      "Saved senior developers about 15 – 30 minutes each day by building a CI/CD pipeline to automate the build and deploy process of the UWP and iOS mobile apps",
      "Deployed a prototype application to a HIPPA compliant cloud hosting service called MedStack within a few hours of reading the documentation",
      "Created a development environment that allowed a new developer to have a mock environment setup in less than a minute with one command by using docker compose and npm scripts to spin up a local copy of the cloud environment"
    ]
  },
  {
    "company": "ACD Systems",
    "position": "Quality Assurance Analyst",
    "description": "Created and executed test plans for their macOS and Windows photo editing software.",
    "experience": [
      "Discussed test plans and ongoing issues with a supervisor in Japan by using a shared and structured document when only one of us was online",
      "Reduced time to re-install application, a task repeated multiple times in a day, from 1 minute to 1 second by writing a bash script to run the necessary actions"
    ]
  }
]
